Repository: 84000/translation-memory-resources
Catalog: post_input/toh287-C.bo.en.tmx
Source language: bo
Languages: en

source: ཤིན་ཏུ་ བདེ་བ །_ ཤིན་ཏུ་ བརྟན་པ །_ མཐུ་ དང་ ལྡན་པ །_ རྫུ་འཕྲུལ་ དང་ ལྡན་པ །_
en: He is completely at ease, stable, powerful, and in possession of miraculous powers.

source: གར་ ཡང་ འཇིགས་པ་ མེད་པ །_ དབང་པོ་ དང་ བཅས་པ འི་ འཇིག་རྟེན་ ཡང་ གྲངས་ སུ་ མི་ རྩི་བ །_
en: He is also completely fearless and not intimidated by anything in the world, including Śakra.

source: བརྩོན་འགྲུས་ ལྷག་པ ས་ རབ་ཏུ་ རྒྱགས་པ་ ཐམས་ཅད་ ས འི་ འོག་ གི་ གཏིང་ ན་ གནས་པ་ ཡིན་ ལ །_
en: With special vigor, he has developed great haughtiness. His realm is located deep below the earth.

source: དེ་ལས་ འོག་ ཏུ་ གྱུར་པ་ ནི་ གཞན་ གང་ཡང་ མེད་ དེ དེ་ ནོར་བུ འི་ ས་གཞི འི་ སྟེང་ ན་ གནས་ སོ །_།
en: From there it is impossible to go any deeper, because it rests upon a jewel ground.

source: དེ་ རྟག་པ ར་ ཡིད་ རབ་ཏུ་ དགའ་ ཞིང་ རྟག་ ཏུ་ སྤྲོ་ ལ་ དགའ་བ་ རྟག་པ ར་ ཡིད་ སྣ་ཚོགས་ སུ་ ཤིན་ཏུ་ ཕྱེ་བ །_ ཡུལ་ གྱི་ སྲིད་པ་ སྣ་ཚོགས་ ལ་ རྣམ་པར་ [25a] ཆགས་པ་ དག་ གནས་ གཞན་ བཞི་པ་ གྲོང་ཁྱེར་ ཟབ་པ་ ན་ ཤིན་ཏུ་ བདེ་བ ར་ གནས་ སོ །_།
en: $185 “The inhabitants of this realm are constantly joyous, cheerful, and happy, yet their minds are also very distracted and absorbed in various obsessions. [25.a] And so, this distinct fourth realm is far more enjoyable than the city of Profound.

source: གྲོང་ཁྱེར་ དེ་ཡང་ ཀུན་ ནས་ པད་མ འི་ རྫིང་ དང་ །_ ལྟེང་ཀ་ དང་ །_ འབབ་ཆུ འི་ དངོ་ དང་ །_ བསྐྱེད་པ འི་ ས་ དང་ །_ ར་བ ས་ མཛེས་པ ར་ བྱས་པ །_ རིན་པོ་ཆེ་ སྣ་ བདུན་ གྱི་ ཁང་པ ས་ བརྒྱན་པ །_ འགྲན་ཟླ་ དང་ བྲལ་བ །_
en: Featuring lotus ponds, pools, cascades, gardens, ornamental fences, and mansions made of the seven precious substances, this city is unrivaled.

source: ཕན་ཚུན་ བཤེས་གཉེན་ མི་ འཐུན་པ་ དང་ བྲལ་བ །_ ཕན་ཚུན་ འཁྲུག་པ་ དང་ བྲལ་བ །_ འགྲན་ཟླ འི་ འཇིགས་པ་ དང་ བྲལ་བ །_
en: Those who live therein are all on friendly terms, free from any animosity or fear of rivalry.

source: ནམ་མཁའ་ གཉིས་པ་ ལྟ་བུ་ ཡིན་ ཏེ ཇི་ལྟ ར་ ནམ་མཁའ་ ལ་ གཟའ་ དང་ །_ རྒྱུ་སྐར་ དང་ །_ སྐར་མ འི་ ཚོགས་ རྣམ་པ་ དུ་མ་ དག་ གིས་ མཛེས་པ ར་ བྱས་པ་ དེ་ལྟ ར་ གྲོང་ཁྱེར་ དེ་ཡང་ ཀུན་ ནས་ རིན་པོ་ཆེ་ རྣམ་པ་ སྣ་ཚོགས་ དག་ གིས་ བརྒྱན་ ཅིང་ མཛེས་པ་ ཡིན་ ནོ །_།
en: The city is like a second sky, because just as the sky is adorned with planets, stars, and other celestial bodies, this city is decorated and adorned with many different jewels.

source: འདིར་ ཚིགས་ སུ་ བཅད་པ །_
en: $186 “At this point, there are some verses:

source: བྱེད་ ཀུན་ སེམས་ ལ་ རག་ ལས་ཤིང་ །_། འབྲས་བུ་ སེམས་ ལ་ རག་ ལས་ མཐོང་ །_།
en: “It is observed that all actions depend on the mind And that the effects of actions depend on the mind.

source: ཇི་ལྟ ར་ སེམས་ ནི་ སྣ་ཚོགས་ ལྟར །_། དེ་ལྟ་ བུར་ ནི་ འབྲས་བུ འང་ མཐོང་ །_།
en: It is observed that just as the mind is varied, Such is also the case with effects.

source: འཇིག་རྟེན་ སྲིད་ གསུམ་ རྗེས་འགྲོ་ འདི །_། ཐམས་ཅད་ སེམས་ ཀྱིས་ སྣ་ཚོགས་ བྲིས །_།
en: $187 “The three worlds of existence follow And all are painted by the mind.

source: སེམས་ ཀྱི་ དབང་ དུ་མ་ གྱུར་ གང་ །_། དེ་ ཡི་ གནས་ ནི་ ཡེ་ མེད་ དོ །_།
en: Here, there is never a single place That is not governed by the mind.

source: ཡིད་ ནི་ ཐར་ དང་ བཅིངས་པ་ ཡི །_། གཉིས་ ཀྱི་ གཞི་ དང་ རྒྱུ་ རུ་ འགྱུར །_།
en: $188 “Mind is the basis and cause of Both liberation and bondage.

source: དགེ་བ་ ཡིས་ ནི་ སྐྱེ་བོ་ འགྲོལ །_། མི་དགེ ས་ མྱུར་ དུ་ འཆིང་བ ར་ བྱེད །_།
en: By virtue beings are liberated; By nonvirtue they are quickly bound.

source: དེ་ལྟ ར་ སེམས་ཅན་ སེམས་ ཀྱི་ དབང་ །_། སྲིད་ གསུམ་ དག་ ན་ འཁྱམ་པ ར་ འགྱུར །_།
en: $189 “Thus, due to the power of mind, Sentient beings wander through the three existences.

source: སྲེད་པ ས་ རྨོངས་པ འི་ སེམས་ཅན་ རྣམས །_། སེམས་ ཀྱི་ དབང་ དུ་ གྱུར་ ནས་ འགྲོ །_།
en: Dulled by craving, beings move Under the control of their minds.

source: དམུས་ལོང་ ལམ་བཟང་ མི་ མཐོང་ ལྟར །_། མྱ་ངན་ འདས་པ་ ཐོབ་ མི་ འགྱུར །_།
en: $190 “Like the blind who fail to see the good path, They fail to attain the transcendence of suffering.

source: ཇི་ལྟ ར་ སེམས་ཅན་ དེ་ རྣམས་ ཀྱིས་ ཡང་དག་པ འི་ ལམ་ བསྒྲུབས་པ་ དེ་ལྟ ར་ རྒྱུ་ སྣ་ཚོགས་ དང་ འཐུན་ པར་ གྱུར་པ འི་ གནས་ དེ་ སྣ་ཚོགས་ སུ་ སྣང་ངོ་ །_།
en: $191 “Thus, the more sentient beings succeed in practicing the true path, the more such various causes will make them experience different forms of agreeable realms.

source: འདི་ལྟར་ གནས་ དེ་ གྲོང་ཁྱེར་ དེ འི་ ཕྱི་རོལ་ ན་ འདུག་པ་ ཡིན་ ཏེ ཤིང་ ལྗོན་པ་ དང་ །_ ཉེ་བ འི་ ཚལ་ དང་ །_ ལྟེང་ཀ་ དང་ །_ གྲོང་རྡལ་ དང་ །_ པད་མ འི་ རྫིང་ དང་ །_ ཆུ་བོ་ རྣམ་པ་ སྣ་ཚོགས་ དང་ །_ བྱ་ རྣམ་པ་ བརྒྱ་ སྙེད་ ཀྱིས་ མཛེས་པ ར་ བྱས་པ་ ཡིན་ ནོ །_།
en: $192 “The outskirts of that city within that realm are delightful, ornamented by trees, groves, ponds, villages, lotus pools, various rivers, and hundreds of beautiful species of birds.

source: དེ འི་ གནས་ བཞི་པ་ དེ་ ན་ ལྷ་མ་ ཡིན་ གནས་པ་ གང་ཡིན་པ་ དེ་དག་ ཀུན་ སྤྲོ་ ཞེས་ བྱ་ སྟེ །_ བརྟན་པ །_ བག་ཚ་བ་ མེད་པ །_ ཆ་བྱད་ དང་ རྒྱན་ ཤིན་ཏུ་ བཟང་བ ས་ ལུས་ བརྒྱན་པ་ རྣམས་ གནས་པ །_ ཕན་ཚུན་ [25b] ཡིད་ ལ་ ཅུང་ཟད་ ཀྱང་ འཁྲུག་པ ར་ མི་ བྱེད་པ །_ རྟག་ ཏུ་ ཡིད་ ལ་ སྤྲོ་ ཞིང་ དགའ་བ་ དང་ ལྡན་པ །_
en: The asuras that inhabit that fourth abode are called the cheerful because they are steadfast, undaunted, always dressed in the finest robes and most exquisite ornaments, [25.b] free from the slightest animosity toward one another, and always happy and joyous.

source: བུད་མེད་ ཆ་བྱད་ དང་ རྒྱན་ སྣ་ཚོགས་ ཀྱིས་ བརྒྱན་པ འི་ ཚོགས་ རྣམས་ ཀྱིས་ ཡོངས་སུ་ བསྐོར་ ཅིང་ གནས་ ཏེ བརྒྱ འམ་ ཡང་ན་ སྟོང་ དུ་ དགའ་བ ར་ བྱེད །_ རྩེ་བ ར་ བྱེད །_ ཡོངས་སུ་ སྤྱོད་པ ར་ བྱེད་ དོ །_།
en: Surrounded by groups of women who wear exquisite garments and ornaments, they enjoy themselves, frolic, and partake of pleasures in hundreds and thousands of ways.

source: གནས་ བཞི་པ་ དེ་ཡང་ ནོར་བུ་ ཐོགས་པ འི་ བུད་མེད་ རྣམས་ ཀྱིས་ རྟག་ ཏུ་ བརྒྱན་པ །_ ལྷ་མ་ ཡིན་ ཀུན་ སྤྲོ་ རྣམས་ རྟག་ ཏུ་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ རབ་ སྤྲོའི་ བཀའ་ ཤིན་ཏུ་ ཉན་པ །_ ཡིད་ ཤིན་ཏུ་ ཕྱེ་བ །_
en: $193 “Moreover, this fourth realm is always adorned with females who proffer jewels, and the cheerful asuras always adhere to the command of their asura king, Overjoyed.

source: དེ་ ལ་ བཀའ་ ཉན་པ འི་ ངོ་བོ་ ནི་ རྟག་ ཏུ་ དབང་ དུ་ གྱུར་པ ར་ མཐོང་ ངོ་ །_།
en: Although their minds are scattered, he maintains control because they heed his command.

source: དེ་ནས་ ཡང་ དགེ་སློང་ ལས་ ཀྱི་ འབྲས་བུ་ རྣམ་པར་ སྨིན་པ་ ཤེས་པ་ དེ །_ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ རབ་ སྤྲོའི་ ལས་ ཀྱི་ རྣམ་པར་ སྨིན་པ་ ལ་ རྟོག་པ ར་ བྱེད་ དེ །_
en: $194 “Next, the monk who has knowledge of the ripening of the effects of karmic actions will examine the karmic ripening pertaining to the asura king Overjoyed.

source: དེར་ ལས་ གང་ གིས་ སྐྱེ་བ ར་ འགྱུར་ སྙམ་ ནས །_
en: He will wonder, ‘What karmic action may cause such a birth?’

source: དེས་ ཐོས་པ་ ལས་ བྱུང་བ འི་ ཤེས་པ ས་ བརྟགས་ ན །_ འདི་ལྟར་ འདས་པ འི་ དུས་ ན་ ལོག་པ ར་ ལྟ་བ་ ལ་ ཞེན་པ །_ ལས་ ཀྱི་ འབྲས་བུ་ མངོན་པར་ མི་ ཤེས་པ །_ སངས་རྒྱས་ དང་ །_ ཆོས་ དང་ །_ དགེ་འདུན་ ལས་ ཕྱིར་ ཕྱོགས་པ ར་ གྱུར་པ་ གང་ ལ་ རེ་ཞིག་ ཅིག་ ན་ དགེ་སློང་ ཚུལ་ཁྲིམས་ དང་ ལྡན་པ །_ ཤིན་ཏུ་ བརྩོན་འགྲུས་ དང་ ལྡན་པ་ ལམ་ དུ་ ཞུགས་ པར་ གྱུར་པ་ ཞིག་ གིས་ ནན་ གྱིས་ བསོད་སྙོམས་ གཅིག་ བསླངས་པ་ དང་ བྱིན་ ནོ །_།
en: With knowledge derived from hearing he will then see how some people, who in the past were attached to wrong views, ignorant about the effects of actions, and averse to the Buddha, Dharma, and Saṅgha, may nevertheless offer a meal to a traveling monk, who is disciplined and diligent, when they are earnestly requested to do so.

source: བྱིན་ ནས་ ཀྱང་ བདག་ གིས་ བསོད་སྙོམས་ བྱིན་པ འི་ འབྲས་བུ་ ནི་ དོན་མེད་ ཅིང་ འདི་ ལས་ བདག་ གི་ ཆོས་ སུ་ འགྱུར་བ་ ཡང་ མེད་ ལ །_ ལོག་པ ར་ རབ་ཏུ་ བྱུང་བ །_ དམངས་རིགས་ འདི་ ལ་ བདག་ གིས་ བསོད་སྙོམས་ སྦྱིན་པ་ འདི་ ནི་ ཚྭ་སྒོ་ ཅན་ ལ་ བསོད་སྙོམས་ བྱིན་པ ར་ ཟད་ དོ་ ཞེས་ ཀྱང་ སྨྲ་ ལ །_
en: In retrospect, such a person may think, ‘This donation of food was pointless, and it will bring me nothing good in return. Feeding a commoner like him, who has taken a perverse form of ordination, is as useless as making a donation to a piece of salty soil.’

source: ཞིང་ འབའ་ཞིག་ ཡོན་ཏན་ དང་ ལྡན་ ལ །_ གཞན་ གྱི་ ངོ་ཆེན་ གྱིས་ སྦྱིན་པ་ ཚེར་མ་ ཅན་ ཉམས་པ་ བྱིན་པ་
en: Thus, although the recipient is filled with good qualities and the gift is of help to others, the donation becomes a spoiled and thorn-like gift.

source: དེས་ ལུས་ དང་ བྲལ་ ནས་ ངན་འགྲོ་ ལོག་པ ར་ ལྟུང་བ་ དུད་འགྲོ་ རྣམས་ ཀྱི་ ནང་ དུ་ སྐྱེ་བ ར་ འགྱུར་ ཏེ ས་གཞི་ ཤིན་ཏུ་ འབྱོར་པ །_ རིན་པོ་ཆེ ས་ བརྒྱན་པ །_ གཡོ་བ་ མེད་པ་ དག་ ཏུ་ ཞིང་ ཤིན་ཏུ་ ཡོན་ཏན་ དང་ ལྡན་པ་ དང་ །_
en: Hence, when such people separate from their bodies, they will fall into the lower realms and be born as an animal that lives in an extremely rich environment adorned with jewels: the realm known as Immovable.

source: སེམས་པ ས་ དངོས་པོ་ མ་ བཟུང་བ་ དེ འི་ ལས་ ཀྱི་ རྣམ་པར་ སྨིན་པ ས་ ལྷ་མ་ ཡིན་ ཀུན་ སྤྲོ་ ཞེས་ བྱ་བ་ རྣམས་ ཀྱི་ བདག་པོ་ རབ་ སྤྲོ་ ཞེས་ བྱ་བ་ སོ་སོ ར་ འགྲན་པ་ ལྟ་བུ འི་ བདེ་བ་ ཐམས་ཅད་ དང་ ལྡན་པ ར་ འགྱུར་བ་ མཐོང་ ངོ་ །།_།།
en: As the act of giving to a field endowed with tremendous qualities, without mentally acknowledging that, comes to ripen, one will take birth in a situation like that of Overjoyed, the lord of the cheerful asuras, with all his pleasures. [26.a]

source: དེ་ནས་ ཡང་ དགེ་སློང་ ལས་ ཀྱི་ འབྲས་བུ་ རྣམ་པར་ སྨིན་པ་ ཤེས་པ་ དེས་ ལྷ་མ་ ཡིན་ ཀུན་ སྤྲོ་ ཞེས་ བྱ་བ་ རྣམས་ ཀྱི་ ལས་ ཀྱི་ རྣམ་པར་ སྨིན་པ་ ལ་ རྟོག་པ ར་ བྱེད་ དེ
en: $195 “Next, the monk who has knowledge of the ripening of the effects of karmic actions will inquire into the karmic ripening that pertains to the cheerful asuras.

source: ལས་ ཀྱི་ རྣམ་པར་ སྨིན་པ་ གང་ གིས་ ལྷ་མ་ ཡིན་ གྱི་ གནས་ སུ་ ལྷ་མ་ ཡིན་ ཀུན་ སྤྲོ་ དག་ ཇི་ལྟ ར་ སྐྱེ་བ ར་ འགྱུར་ སྙམ་ ནས །_
en: He will wonder, ‘What karmic actions may cause birth among the cheerful asuras?’

source: དེས་ ཐོས་པ་ ལས་ བྱུང་བ འི་ ཤེས་པ ས་ བརྟགས་ ན །_ སྲེད་པ འི་ རོ་ ལ་ ཞེན་པ ར་ གྱུར་པ་ གང་ སེམས་ཅན་ ཡོད་པ འི་ ཚལ་ དུ་ གནས་ ཏེ །_
en: With knowledge derived from hearing he will then see how some people, who live in a forest filled with animals, are attached to the tastes of craving.

source: འདི་ལྟར་ ཚལ་ དེ་དག་ ན་ སེམས་ཅན་ འཁོད་པ་ དེ་ རྣམས་ སུ ས་ ཀྱང་ མ་ བསྡུས །_ གང་ གིས་ ཀྱང་ ལྷུག་ པར་མ་ བཀོད་ དེ །_ བདག་ གིས་ ཚལ་ འདིར་ བསྡུ་བ ར་ བྱ འོ་ སྙམ་ ནས །_
en: Such people will think, ‘I shall not let anyone gather the animals in this forest, nor shall I let anyone herd them. Rather, I shall keep this forest to myself.’

source: སེམས་ཅན་ ལ་ སྙིང་བརྩེ་བ འི་ ཕྱིར་ དང་ །_ བདག་ཉིད་ ཀྱི་ འཚོ་བ་ སྦྲང་རྩི་ དག་ འདོད་པ འི་ ཕྱིར་ སྡུད་པ ར་ བྱེད་ ན །_
en: Thus, out of love for the animals and due to a wish to live from collecting honey, such a person will then proceed to collect it.

source: དེ་ ལུས་ དང་ བྲལ་ ནས་ ལྷ་མ་ ཡིན་ རྣམས་ ཀྱི་ ནང་ དུ་ སྐྱེ་བ ར་ འགྱུར་ ཏེ །_ དེ འི་ འཚོ་བ འི་ ཕྱིར་ སེམས་ཅན་ བསྲུངས་པ འི་ རྣམ་པར་ སྨིན་པ འི་ རྒྱུས །_ ཀུན་ སྤྲོ་ རྣམས་ ཀྱི་ ནང་ དུ་ སྐྱེ་བ ར་ འགྱུར་བ་ མཐོང་ ངོ་ །_།
en: When such people later separate from their bodies, they will be born among the asuras, and the ripening of the act of protecting sentient beings for the sake of their livelihood will cause them to become cheerful asuras.

source: དེ་ནས་ ཡང་ དགེ་སློང་ ལས་ ཀྱི་ འབྲས་བུ་ རྣམ་པར་ སྨིན་པ་ ཤེས་པ་ དེས །_ ལྷ་ དང་ ལྷ་མ་ ཡིན་ གཡུལ་འགྱེད་པ་ ལ་ རྟོག་པ ར་ བྱེད་ དེ །_
en: $196 “Next, the monk who has knowledge of the ripening of the effects of karmic actions will examine the war between the gods and the asuras.

source: དེས་ ཐོས་པ་ ལས་ བྱུང་བ འི་ ཤེས་པ ས་ བརྟགས་ ན །_ འདི་ལྟར་ ཀླུ འི་ གཙོ་བོ་ ལོངས་སྤྱོད་ ལྡན་ ན་ གནས་པ་ ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ་ མགོ་ བདུན་ ཡོད་པ་ འདི་ལྟ་སྟེ །_
en: With knowledge derived from hearing he will notice the seven-headed nāga leaders, who are righteous and follow the Dharma, living at Endowed with Enjoyments.

source: ཀླུ འི་ རྒྱལ་པོ་ ནོར་ རྒྱས་ ཀྱི་ བུ་ དང་ །_ ཀླུ འི་ རྒྱལ་པོ་ འཇོག་པོ་ དང་ །_ ཀླུ འི་ རྒྱལ་པོ་ བཟང་པོ་ དང་ །_ ཀླུ འི་ རྒྱལ་པོ་ རོ་ ཧི་ ན་ དང་ །_ ཀླུ འི་ རྒྱལ་པོ་ སྤྲིན་ ཕྲེང་ དང་ །_ ཀླུ འི་ རྒྱལ་པོ་ ཀློང་ དང་ །_ ཀླུ འི་ རྒྱལ་པོ་ ཀུན་འགྲོ་ དང་ །_ ཀླུ འི་ རྒྱལ་པོ་ རབ་ སྤྲོ་ དང་ །_ ཀླུ འི་ རྒྱལ་པོ་ ཆར་ འབེབས་ ཏེ
en: They are the nāga king Vāsuki, the nāga king Takṣaka, the nāga king Bhadraka, the nāga king Rohina, the nāga king Meghamālin, the nāga king Expanse, the nāga king Ahi, the nāga king Joyous, and the nāga king Rainfall.

source: དེ་དག་ ནི་ ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ །_
en: They are all righteous and follow the Dharma.

source: ཡང་དག་པ འི་ ལྟ་བ་ དང་ །_ ཚུལ་ཁྲིམས་ ལ་ ཞུགས་པ་ ཡིན་ ནོ །_།
en: They possess the right view and observe spiritual discipline.

source: སྔ་མ་ བཞིན་ དུ་ སྦྱར་ ཏེ །_ ཆོས་ དང་ མི་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ མི་ འཇུག་པ་ ལ་ འདི་ལྟ་སྟེ །_ ཀླུ འི་ རྒྱལ་པོ་ རབ་ འཇོམས་ དང་ །_ ཀླུ འི་ རྒྱལ་པོ་ བསྒྱིངས་པ་ དང་ །_ ཀླུ འི་ རྒྱལ་པོ་ ནག་པོ་ དང་ །_ ཀླུ འི་ རྒྱལ་པོ་ ཧུ་ ལུ་ ཧུ་ ལུ་ དག་ ཕམ་པ ར་ གྱུར་པ་ དེ འི་ ཚེ་ ས འི་ འོག་ ན་ གནས་པ་ དང་ །_ རི་རབ་ ལ་ རྟེན་པ་ དང་ །_ ཆུ འི་ ནང་ དུ་ ཞུགས་པ་ ག་ལ་ བ་ དེར་ རྒྱུག་ [26b] པར་ བྱེད་ དེ
en: When they defeat the nāga kings who are unrighteous and do not follow the Dharma, such as the nāga king Pramatha, the nāga king Aṭopa, the nāga king Kāla, and the nāga king Huluhulu, the latter will flee to their dwellings below the surface of the earth, on Mount Sumeru, or within the waters. [26.b]

source: འདི་ལྟ་སྟེ །_ གནས་ དང་པོ་ ལ་ རྟེན་པ འི་ ལྷ་མ་ ཡིན་ རྣམས་ ཀྱིས་ གཉིས་ ཤིང་ རྩེ་བ་ ཞེས་ བྱ་བ འི་ ལྷ་མ་ ཡིན་ དེ་དག་ ལ་ སྨྲས་པ །_ ཀླུ འི་ རྒྱལ་པོ་ ནོར་ རྒྱས་ ཀྱི་ བུ་ དང་ །_ འཇོག་པོ་ ལ་སོགས་པ་ འདི་དག་ དང་ རྒྱལ་ཆེན་ བཞི འི་ ལྷ་ དང་ བཅས་པ ས་ བདག་ཅག་ གཙེས་ ཀྱིས་ ཁྱེད་ བདག་ཅག་ གི་ གྲོགས་ སུ་ ཚུ ར་ ཤོག་ རྒྱུག _།
en: $197 “At that time the asuras who dwell on the first level will tell the asuras in Double Pleasure, ‘The nāga kings Vāsuki, Takṣaka, and so on, are joined by the gods of the Four Great Kings, and now they inflict harm upon us. You must rush to our assistance!’

source: དེ་ནས་ དེ་ ཐོས་ ནས་ ལྷ་མ་ ཡིན་ གཉིས་ ཤིང་ རྩེ་བ་ དག་ ལྷ་མ་ ཡིན་ གྱི་ གྲོང་ཁྱེར་ འོད་ལྡན་ ཞེས་ བྱ་བ་ གང་ ན་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ སྒྲ་གཅན་ གནས་པ་ ག་ལ་བ་ དེར་ དོང་ སྟེ་
en: $198 “When they hear this, the asuras in Double Pleasure will journey to the asura city Radiant and the residence of the asura king Rāhu.

source: ཕྱིན་ ནས ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ སྒྲ་གཅན་ ལ་ སྔ་མ་ བཞིན་ དུ་ ཐམས་ཅད་ བསྙད་ དོ །_།
en: In the same way as before, they will report everything to Rāhu, king of the asuras.

source: དེ་ནས་ གལ་ཏེ་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ སྒྲ་གཅན་ འདི་ལྟར་ དགེ་སྦྱོང་ དུ་ འཛིན་པ་ དང་ །_ བྲམ་ཟེ ར་ འཛིན་པ་ དང་ །_ བྱས་པ་ ལ་ ཕན་ འདོགས་པ་ དང་ །_ རིགས་ ཀྱི་ རྒན་རབས་ ལ་ གུས་པ ར་ བྱེད་པ ར་ ཤེས་པ་ དེ འི་ ཚེ་ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ སྒྲ་གཅན་ ཀླུ འི་ རྒྱལ་པོ་ རབ་ འཇོམས་ ལ་སོགས་པ་ ལ །_ འདི་ལྟར་ བདག་ཅག་ གི་ གནས་ གཉིས་པ་ ན་ གནས་པ འི་ ལྷ་མ་ ཡིན་ རྣམས་ ལ་ འདི་ལྟར་ ལྷ་ རྣམས་ ཀྱིས་ བདག་ཅག་ མངོན་པར་ གཙེས་ སོ་ ཞེས་ སྦྲན་པ ར་ བྱ་བ འི་ བར་ དུ་ སྔ་མ་ བཞིན་ དུ་ སྦྱར་ ཏེ
en: If at that time Rāhu knows that people respect mendicants, respect brahmins, return kindness, and have respect for their elders, he will now tell Pramatha and other such nāga kings that asuras of the second level have come to call upon him because the gods are hurting them.

source: ཀླུ འི་ རྒྱལ་པོ་ འཇོག་པོ་ ལ་སོགས་པ་ དེ་དག་ ཉིད་ ཁོག་ ཤིག་ ཁོག་ ཤིག་ ཅེས་ བསྒོའོ །_།
en: He will then instruct the nāga kings, ‘Go stop the nāga king Takṣaka and the rest! Go stop them!’

source: དེ་ནས་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ སྒྲ་གཅན་ གནས་ གཉིས་པ་ ན་ གནས་པ འི་ ལྷ་མ་ ཡིན་ མགུལ་ ཕྲེང་ ཞེས་ བྱ་བ་ དེ་དག་ ལ་ འདི་ལྟར་ ཀླུ འི་ རྒྱལ་པོ་ རབ་ འཇོམས་ ལ་སོགས་པ །_ ཀླུ འི་ རྒྱལ་པོ་ ནོར་ རྒྱས་ ཀྱི་ བུ་ དང་ །_ འཇོག་པོ་ ལ་སོགས་པ་ དང་ །_ རྒྱལ་ཆེན་ བཞི འི་ རིས་ ཀྱི་ ལྷ་ རྣམས་ ཀྱིས་ མངོན་པར་ གཙེས་ སོ་ ཞེས་ སྨྲས་ སོ །_།
en: $199 “Next, the asura king Rāhu will tell the necklace asuras who reside on the second level that the nāga king Pramatha and the rest are being attacked by nāga kings such as Takṣaka and the gods of the realm of the Four Great Kings.

source: དེ་ནས་ དེ་ ཐོས་ ནས །_ ལྷ་མ་ ཡིན་ མགུལ་ ཕྲེང་ དག་ ལྷ་མ་ ཡིན་ གྱི་ གྲོང་ སྐར་ ཕྲེང་ ཞེས་ བྱ་བ་ ན་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ འཁོད་པ་ གང་ཡིན་པ་ དེ་དག་ ལ་ འདི་ལྟར་ ཀྱེ་ རྒྱལ་པོ་ ཆེན་པོ་ བདག་ཅག་ ལ་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ སྒྲ་གཅན་ དང་ །_ ཀླུ འི་ རྒྱལ་པོ་ རབ་ འཇོམས་ ལ་སོགས་པ་ ན་རེ་ འདི་ལྟར་ ཀླུ འི་ རྒྱལ་པོ་ རབ་ འཇོམས་ ལ་སོགས་པ་ དག་ ཀླུ འི་ རྒྱལ་པོ་ འཇོག་པོ་ དང་ །_ ནོར་ རྒྱས་ ཀྱི་ བུ་ ལ་སོགས་པ་ དང་ །_ རྒྱལ་ཆེན་ བཞི འི་ ལྷ་ རྣམས་ ཀྱིས་ མངོན་པར་ གཙེས་ སོ་ ཞེས་ མཆིའོ །_།
en: When they hear this news, the necklace asuras will inform the royal ruler of the asuras who resides in the asura city known as Star Garland, saying, ‘O great king, the asura ruler Rāhu, the nāga king Pramatha, and others have told us that nāga kings such as Pramatha are under siege from nāga kings such as Takṣaka and Vāsuki, along with the gods of the realm of the Four Great Kings.’

source: ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ ས་ དེ་ ཐོས་ ནས གལ་ཏེ་ དགེ་སྦྱོང་ དུ་ འཛིན་པ་ དང་ །_ བྲམ་ཟེ ར་ འཛིན་པ འི་ སྐྱེ་དགུ་ [27a] ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ་ འབྱུང་བ་ དང་ །_ བདག་ཉིད་ ཀྱི་ སྟོབས་ ཆེ་ཆུང་ མཐོང་བ་ དེ འི་ ཚེ །_ ལྷ་མ་ ཡིན་ མགུལ་ ཕྲེང་ དེ་དག་ ལ་ འདི་ལྟར་ ཀྱེ་མ་ འཛམ་བུ འི་ གླིང་ གི་ མི་ རྣམས་ ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ ས་ ལྷ་ རྣམས་ སྟོབས་ རབ་ཏུ་ ཆེ་ སྟེ
en: $200 “As the asura ruler receives this message, if people respect mendicants and brahmins [27.a] and follow the Dharma, he will look at the level of his own powers and then say to the necklace asuras, ‘Alas, the people of Jambudvīpa are righteous and follow the Dharma, and therefore the gods are extremely strong.

source: འདི་དག་ བདག་ གིས་ གནས་ གསུམ་པ་ ན་ གནས་པ འི་ ལྷ་མ་ ཡིན་ རྣམས་ ལ་ སྔ་མ་ བཞིན་ བསྙད་པ ར་ བྱ འོ་ ཞེས་ སྨྲས་ སོ །_།
en: I shall now pass this full message to the asuras who live on the third level.’

source: དེ་ནས་ ལྷ་མ་ ཡིན་ ཀུན་འགྲོ་ ཞེས་ བྱ་བ་ ལ་ བསྙད་ དོ །_། དེ་ནས་ ལྷ་མ་ ཡིན་ ཀུན་འགྲོ་ དག་ གིས་ གང་ ན་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ མེ་ཏོག་ ཕྲེང་ ཞེས་ བྱ་བ་ གནས་པ འི་ གྲོང་ཁྱེར་ ཟབ་པ་ ཞེས་ བྱ་བ་ ག་ལ་བ་ དེར་ དོང་ སྟེ་ ལྷ་མ་ ཡིན་ ཀུན་འགྲོ ས་ དེ་ ཐམས་ཅད་ སྔ་མ་ བཞིན་ བསྙད་ དོ །_།
en: He will then inform the so-called ever-present asuras, and the latter will travel to the asura ruler Puṣpamāla, who resides in the city of Profound, and convey the entire message to him.

source: དེ་ནས་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ མེ་ཏོག་ ཕྲེང་ ཞེས་ བྱ་བ ས །_ གལ་ཏེ་ ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ །_ དགེ་སྦྱོང་ དུ་ འཛིན་པ་ དང་ །_ བྲམ་ཟེ ར་ འཛིན་པ འི་ སྐྱེ་དགུ་ མཐོང་ ན དེས་ ལྷ་མ་ ཡིན་ དེ་དག་ ལ་ འདི་ལྟར་ གནས་ བཞི་པ་ ན་ གནས་པ འི་ ལྷ་མ་ ཡིན་ རྣམས་ ལ་ མངོན་པར་ བསྙད་པ ར་ བྱ འོ་ ཞེས་ སྨྲས་ སོ །_།
en: $201 “At that time King Puṣpamāla may see that people are righteous and follow the Dharma, and he may see that people respect mendicants and brahmins. In that case he will tell those asuras that he is going to inform the asuras who live on the fourth level.

source: དེ་ནས་ གནས་ གསུམ་པ་ ན་ གནས་པ འི་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ ས་ གནས་ བཞི་པ་ ལ་ གནས་པ འི་ ལྷ་མ་ ཡིན་ རྣམས་ འཁོད་པ་ ག་ལ་བ་ དེར་ དོང་ སྟེ །_
en: The ruler of the asuras of the third level will then travel to the assembly of the asuras of the fourth level.

source: འདི་ལྟར་ ཀླུ འི་ རྒྱལ་པོ་ རབ་ འཇོམས་ ལ་སོགས་པ་ དག་ ཀླུ འི་ རྒྱལ་པོ་ འཇོག་པོ་ དང་ །_ ནོར་ རྒྱས་ ཀྱི་ བུ་ ལ་སོགས་པ་ རྒྱལ་ཆེན་ བཞི འི་ ལྷ་ རྣམས་ ཀྱིས་ མངོན་པར་ གཙེས་ ཏེ །_
en: There, he will say, ‘Pramatha and other such nāga kings are under siege from Takṣaka, Vāsuki, and other nāga kings, who are assisted by the gods of the realm of the Four Great Kings.

source: དེ་ལྟ ར་ ཀླུ་ འདི་དག་ ནི་ བདག་ཅག་ གི་ ཕྱོགས་ ཡིན་པ ས་ བདག་ཅག་ རྣམས་ ཀྱིས་ ངེས་པ ར་ ལྷ་ རྣམས་ ཀྱི་ བར་ཆད་ བྱ་བ་ ལ་ འབད་པ ར་ བྱ འོ་ ཞེས་ སྨྲས་ སོ །_།
en: Those nāgas are on our side, so we must definitely attempt to create obstacles for the gods.’

source: དེ་ནས་ གནས་ བཞི་པ་ ལ་ གནས་པ འི་ ལྷ་མ་ ཡིན་ དཔུང་ བཟངས་ དག་ གིས་ དེ་དག་ མཐོང་ ནས །_ གྲོང་ཁྱེར་ ཟབ་པ་ ཞེས་ བྱ་བ་ གང་ ན་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ རབ་ སྤྲོ་ ཞེས་ བྱ་བ་ ག་ལ་བ་ དེར་ དོང་ ངོ་ །_།
en: $202 “When the armies of the asuras of the fourth level make the same observation as before, they will go before the asura ruler Overjoyed, who resides in the city of Profound.

source: དེ་ནས་ ལྷ་མ་ ཡིན་ རིངས་ ཐབས་ སུ་ འོང་བ་ དེ་དག་ མཐོང་ ནས །_ ལྷ་མ་ ཡིན་ རྣམས་ ཅིའི་ཕྱིར་ རིངས་ ཐབས་ སུ་ འོངས་ ཞེས་ དྲིས་ སོ །_། དེ་ནས་ ལྷ་མ་ ཡིན་ དཔུང་ བཟངས་ དག་ གིས་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ རབ་ སྤྲོ་ ལ་ སྔ་མ་ ཇི་ལྟ་བ་ བཞིན་ བསྙད་ དོ །_།
en: When the latter beholds the approaching asuras, he will ask them what their mission is, and the asura armies will pass on the message to the asura ruler Overjoyed.

source: དེ་ནས་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ རབ་ སྤྲོས་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ དེ་དག་ ལ་ འདི་སྐད་ ཅེས་
en: Having received their message, the asura king Overjoyed will proclaim to the assembled asura rulers,

source: ཀྱེ་མ་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ སྒྲ་གཅན་ དག་ བརྩོན་འགྲུས་ ཆུང་བ་ ཡིན་ ཏེ །_ ཀླུ འི་ རྒྱལ་པོ་ རབ་ འཇོམས་ ལ་སོགས་ [27b] པ་ གནས་པ་ གང་ཡིན་པ་ དེ་དག་ རྒྱལ་ཆེན་ བཞི འི་ ལྷ་ རྣམས་ ཀྱིས་ ཕམ་པ ར་ བྱས་ ཏེ །_
en: ‘Alas, the asura ruler Rāhu has little vigor, and hence the subjects of nāga kings such as Pramatha [27.b] have been defeated by the gods of the realm of the Four Great Kings.

source: དེ་དག་ ལ་ བདག་ གིས་ དགེ་སྦྱོང་ དུ་ འཛིན་པ་ དང་ །_ བྲམ་ཟེ ར་ འཛིན་པ འི་ སྐྱེ་དགུ་ རྩིས་ ལ་མ་ ཆགས་པ་ དང་ །_ ཆོས་ ཀྱི་ རྗེས་སུ་ ཆོས་ སྒྲུབ་པ་ རྩིས་ ལ་མ་ ཆགས་པ ར་ བྱ འོ་ ཞེས་ སྨྲས་ སོ །_།
en: Now, let us not be overly concerned by the fact that people respect mendicants and brahmins and that they practice the Dharma.’

source: དེ་ནས་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ དེ་ རང་ གི་ ལྷ་མ་ ཡིན་ རྣམས་ འཁོད་པ་ ག་ལ་བ་ དེར་ དོང་ ངོ་ །_། དེ་ནས་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ རབ་ སྤྲོ་ དཔུང་ བཟངས་ དག་ ལ་ འདི་ལྟར་ བདག་ ནི་
en: $203 “Next, the asura ruler Overjoyed will go before his own assembly of asuras and say to his armies,

source: ཀླུ འི་ རྒྱལ་པོ་ འཇོག་པོ་ དང་ །_ ནོར་ རྒྱས་ ཀྱི་ བུ་ ལ་སོགས་པ་ དང་ །_ རྒྱལ་ཆེན་ བཞི འི་ ལྷ་ རྣམས་ ལ་བར་ ཆད་ བྱ་བ འི་ ཕྱིར་ ཆས་ ཏེ ལྷ་མ་ ཡིན་ རྣམས་ ཀྱི་ དབང་པོ འི་ བརྩོན་འགྲུས་ དང་ །_ སྤྲོ་བ་ དང་ །_ འཁོར་ དང་ བཅས་པ །_ མཚུངས་པ་ མེད་པ་ ཐམས་ཅད་ ལྷ་ རྣམས་ དང་ གཡུལ་འགྱེད་ པར་ འདོང་ གིས་ འདི་ལྟར་ ལྷ་མ་ ཡིན་ རྣམས་ མྱུར་ དུ་ ཆོས་ ཤིག་ མྱུར་ དུ་ ཆོས་ ཤིག་ ཅེས་ བསྒོའོ །_།
en: ‘Sally forth and create obstacles for the nāga kings such as Takṣaka and Vāsuki, and for the gods of the realm of the Four Great Kings! The vigor, enthusiasm, and retinue of the king of asuras are unrivaled, so let us wage war with the gods! Asuras, quickly, ready yourselves! Quickly, ready yourselves!’

source: དེ་ནས་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ རབ་ སྤྲོས་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ གསུམ་ དག་ ལ་
en: $204 “To the other three rulers of the asuras, the asura ruler Overjoyed will then say,

source: གང་ ཆོས་ ཀྱི་ རྣམ་པ་ འདི་ ལྟ་བུ་ བཟོད་པ་ ཁྱོད་ ལ་ ཅི་ བརྩོན་འགྲུས་ མེད་ དམ །_ རྟེན་ མེད་ དམ །_ འདི་ལྟར་ བདག་ ནི་ རང་ གི་ ལག་མཐུ་ དང་ བརྩོན་འགྲུས་ དང་ ལྡན་པ ས་ ཆ འོ་ ཞེས་ སྨྲས་ སོ །_།
en: ‘How could you accept this state of affairs? Have you no diligence? Have you no courage? Since I hold both power and vigor in my own hands, I will act!’

source: དེ་ནས་ ཡང་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ རབ་དགོད་ རིང་པོ ར་ མ་ཐོགས་པ ར་ རང་ གི་ ལྷ་མ་ ཡིན་ རྣམས་ ལ་
en: $205 “Before long the asura king Overjoyed will call upon his own asuras:

source: གྲོགས་པོ་ དག་ རིངས་པ ར་ ཆོས་ ཤིག་ རིངས་པ ར་ ཆོས་ ཤིག _། ཅེས་ འདི་ལྟར་ བདག་ གིས་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ མ་ལུས་པ་ རྣམས་ ལ་ ཡང་ སྦྲན་ ཟིན་ ཏེ
en: ‘Friends, quickly, ready yourselves! Quickly, ready yourselves! I have already called upon all the kings of the asuras.

source: བདག་ མྱུར་ དུ་ ཆ་ ཡིས །_ ལག་ ཏུ་ མཚོན་ཆ་ སྣ་ཚོགས་ བླངས་པ ར་ ཤེས་ ནས །_ ལྷ་མ་ ཡིན་ གྱི་ གཡུལ་ ལ་ བརྩོན་པ ར་ གྱིས་ ཤིག _།
en: Now that you know that I act quickly and carry arms, you must enter the war of the asuras with fervor.

source: དེ་དག་ གི་ བློ་རིག་ ནས་ བསྒྲུབ་པ ར་ བྱ་བ འི་ ཆོས་ གང་ཡིན་པ་ དེ་དག་ བསྒྲུབ་པ ར་ བྱ་ སྟེ །_
en: Now that we know their intentions, we must do what needs to be done.

source: ལྷ་ རྣམས་ ཀྱིས་ ཕམ་པ ར་ བྱར་ མི་ བཟོད་ དོ་ ཞེས་ སྨྲས་ སོ །_།
en: We shall no longer accept defeat by the gods!’
